{
  "start": "courtyard",
  "rooms": {
    "archive": {
      "title": "Grand Archive",
      "desc": "Dusty shelves and chained tomes tower above you. Scroll cases are stacked in neat rows like a scholar's maze. A locked iron door leads EAST. A sealed stair rises NORTH behind a lectern. The runes on the stair match symbols in your journal.",
      "exits": {
        "SOUTH": "archway",
        "EAST": "keep",
        "NORTH": "scriptorium"
      },
      "items": {
        "sealshard": "A shard of rune-stone chipped from the broken archive seal."
      },
      "needs": {
        "EAST": {
          "item": "key",
          "msg": "The door is sealed by an old lock. You need a proper key."
        }
      },
      "consumes": {
        "EAST": true
      },
      "looks": {
        "door": "A thick iron door marked with the crest of a forgotten house.",
        "lectern": "A stone lectern carved with a shallow groove shaped like a book."
      },
      "uses": {
        "manual:lectern": "The journal's sigils align with the groove. The rune seal cracks open."
      },
      "flags": {
        "manual": "archive_seal_broken"
      },
      "needflags": {
        "NORTH": {
          "flag": "archive_seal_broken",
          "msg": "The stair is sealed by a rune. The lectern may hold a clue."
        }
      },
      "hidden": {
        "sealshard": "archive_seal_broken"
      }
    },
    "archway": {
      "title": "Torchlit Archway",
      "desc": "A narrow stone passage flickers with torchlight. Rusted weapon racks line the WEST wall. The corridor stretches NORTH into the older depths of the keep.",
      "exits": {
        "SOUTH": "courtyard",
        "NORTH": "archive"
      },
      "items": {
        "torch": "A resin torch wrapped in old linen."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "torch": "The cloth is dry. It should still burn."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "cavern": {
      "title": "Crystal Cavern",
      "desc": "Veins of pale crystal run through the chamber walls. Cold air hums with ancient magic and distant echoes. A moonlit arch lies SOUTH.",
      "exits": {
        "DOWN": "keep",
        "SOUTH": "gate"
      },
      "items": {
        "gem": "A clear mountain gem trapped in old mineral growth."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "gem": "It catches light and throws stars across the stone."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "chapel": {
      "title": "Sunken Chapel",
      "desc": "A chapel of cracked marble sits in stale silence. A blackened altar stands at the far wall. Stone steps descend DOWN into darkness. The stairwell feels sealed until the altar is rekindled.",
      "exits": {
        "WEST": "keep",
        "DOWN": "crypt"
      },
      "items": {},
      "needs": {},
      "consumes": {},
      "looks": {
        "altar": "Ash and wax coat the altar in thick layers."
      },
      "uses": {
        "torch:altar": "You set the altar ablaze. Warm light floods the chapel and the stair opens."
      },
      "flags": {
        "torch": "chapel_blessed"
      },
      "needflags": {
        "DOWN": {
          "flag": "chapel_blessed",
          "msg": "The stairwell rejects you. The altar remains cold."
        }
      },
      "hidden": {}
    },
    "courtyard": {
      "title": "Castle Courtyard",
      "desc": "You stand in the courtyard of a ruined castle at dusk. Ivy grips cracked stone walls and ravens circle overhead. A torchlit archway yawns to the NORTH. A neglected well lies to the EAST. Dusty shelves sag under a collapsed cloister walk.",
      "exits": {
        "NORTH": "archway",
        "EAST": "well"
      },
      "items": {
        "manual": "A weathered adventurer's journal."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "manual": "Its pages mention a hidden archive seal and a chapel altar that answers flame.",
        "dusty shelves": "Broken ledgers and candle stubs litter the shelves. One margin note reads: \"Books open seals.\""
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "crypt": {
      "title": "Whispering Crypt",
      "desc": "Pillars crowd a low crypt where whispers ride the damp air. A narrow stair climbs UP toward the chapel. A red stone gleams on an old tomb.",
      "exits": {
        "UP": "chapel"
      },
      "items": {
        "sigil": "An ember-red sigil stone warm to the touch."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "sigil": "The symbol pulses like a heartbeat, as if it belongs to a gate."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "gate": {
      "title": "Moonlit Gate",
      "desc": "Moonlight spills through high arches onto runes cut into the floor. A shimmering gate to the EAST flickers in and out of sight. It seems to hunger for a source of arcane power.",
      "exits": {
        "NORTH": "cavern",
        "EAST": "hall"
      },
      "items": {},
      "needs": {
        "EAST": {
          "item": "sigil",
          "msg": "The gate shivers but holds shut. It needs a charged sigil."
        }
      },
      "consumes": {
        "EAST": true
      },
      "looks": {
        "portal": "Mist curls within the arch, hiding a hall lit by distant fire."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "hall": {
      "title": "Hall of Legends",
      "desc": "You step into a vaulted hall of banners, gold, and song. Ancient champions are carved into pillars on every side. Minstrels strike triumphant chords as the firelight dances. You have reached the heart of the keep and claimed victory. Type QUIT to return to the courtyard.",
      "exits": {
        "SOUTH": "gate"
      },
      "items": {},
      "needs": {},
      "consumes": {},
      "looks": {},
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "keep": {
      "title": "Inner Keep",
      "desc": "The fortress heart is quiet, heavy, and watchful. Torn banners hang above old stone braziers. A spiral stair climbs UP to crystal chambers. A chapel lies EAST.",
      "exits": {
        "WEST": "archive",
        "UP": "cavern",
        "EAST": "chapel"
      },
      "items": {},
      "needs": {},
      "consumes": {},
      "looks": {},
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "scriptorium": {
      "title": "Forgotten Scriptorium",
      "desc": "Desks of rotted oak fill a vaulted writing hall. Quills and inkstones lie where scribes left them centuries ago. A bronze vault door stands EAST.",
      "exits": {
        "SOUTH": "archive",
        "EAST": "vault"
      },
      "items": {
        "glyph": "A thin slate tablet marked with a spiral glyph."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "glyph": "The spiral mirrors the seal pattern from the archive lectern."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "vault": {
      "title": "Royal Vault",
      "desc": "Gilded chests and cracked statues line a narrow vault. Dust hangs in still air above a single iron stand.",
      "exits": {
        "WEST": "scriptorium"
      },
      "items": {
        "crown": "A dented but regal crown set with dark green stones."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "crown": "Despite the dents, it still carries the weight of a kingdom."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    },
    "well": {
      "title": "Neglected Well",
      "desc": "Broken buckets and rotted rope are piled around a dry stone well. Weeds claw through cracks in the flagstones. Something glints beneath the rubble.",
      "exits": {
        "WEST": "courtyard"
      },
      "items": {
        "key": "A heavy iron key etched with a lion crest."
      },
      "needs": {},
      "consumes": {},
      "looks": {
        "key": "Its worn teeth look old, but still sharp enough to turn a stubborn lock."
      },
      "uses": {},
      "flags": {},
      "needflags": {},
      "hidden": {}
    }
  },
  "winRoom": "hall",
  "treasures": [
    "sealshard",
    "gem",
    "glyph",
    "crown"
  ]
}